package roman.JavaCoreInfo;

public class AccessModifierInfo {
    public static void main(String[] args) {
//! Модифікатори доступу- це ключові слова (окрім модифікатора за замовчуванням).
//! За допомогою них в Java регулюється рівень доступу до класу та членів класу
//!     (іншою мовою їх область видимості в різних частинах програми).
//! Всього в Java існує чотири модифікатора доступу: public, protected, private та за замовчуванням (default).
//! Для не вкладених класів можна застосувати лише два з них: public та default.
//! Для полів і методів всі чотири.

//! public
//!     загально доступний клас або член класу, до якого можна звернутися з любої частини програми.
//! protected
//!     видимість в межах пакету, а також у всіх спадкоємцях класу,
//!     в якому було оголошено член класу з модифікатором protected.
//! private
//!     члени класу мають видимість лише в межах класу, в якому їх було оголошено
//! default
//!     за замовчуванням, тобто коли модифікатор доступу взагалі не було вказано з використанням ключового слова.
//!     Доступ до таких класів і членів класу, обмежується рамками пакету,
//!     в якому вони були оголошені (“package visible”)
    }
}
