package Lesson;

public class Les2PrimTypDaten {
    public static void main(String[] args) {
        // примітивні типи даних 8 штук!!
        // [20] 4 byte (в пам'яті виділяється комірка під цю змінну)
        // int це скільки пам'яті необхідно виділити

        int number = 20; // тип змінної int, назва number і значення яке зберіг.в змінній
        System.out.println(number);

        byte b = 126; // 8 біт, діапазон від -128 до 127 (2 у 8 степені)
        short s = 32000; // 16 біт (2 у 16 степені)
        int i = 20; // 32 біт (2 у 32 степені)
        char c = 49; // 16 біт, сюди записується символ або число, що показ.символ, який знах.в табл.unicode
        long l = 20456878923L; // 64 біт

        // логічний тип даних
        boolean b1 = true; // тільки true (1) або false (0),32 біта

        //типи з точкою що плаває, тобто дробні числа
        float f = 3.14f;// 32 біт
        double d = 23.2314589; //64 біт


        //якщо треба змінити значення змінної і на 100,то звертат.на ім'я (без типу)
        //і = 100;
        //System.out.println(i);



    }
}