package Lesson;

public class Les3Sylo4TypDaten {

    public static void main(String[] args) {
        // ссилочний тип даних (з великої букви завжди!) містить у собі посилання на об'єкт, який знах на хіпі
        //два види пам'яті хіп та стек. Стек це ніби кеш-пам'ять, вона менша, але швидка!зберігає примітивні типи даних
        //хіп це глобальна пам'ять,
        //існують класи обгортки для кожного типу даних: Integer, Byte, Short, Long, Boolean.Класи примін, де неможливо викор.
        //примітивний тип даних

        String str = "hi";
        System.out.println(str);

    }
}
