package Lesson;

public class Les5ObjektUser {

    //java це обєктно-орієнтована мова на основі ООП і використовує об'єкти
    //якщо перемінна static, то вона в єдиному екземплярі для всіх об'єктів
    //статичні методи допоміжні
    //перемінні, які створ.у методах називаються локальні.вони існують у тілі метода
    //перемінні у класах - глобальні, вони з властивостями об'єктів
    //поведінка об'єктів описується методами

    public int age;
    public String name;
    public String passport ; //параметри якими володіє об'єкт Les5
}
