package roman.kotL17Set;

import java.util.LinkedHashSet;
import java.util.Scanner;
import java.util.Set;

//* scanner.nextLine(); //очистити буфер сканера

//* while з інтами
//    while (true) {
//        Integer input = scanner.nextInt();
//        if (input == 0) {
//            break;
//        }
//    }

public class L17DZ {







    //! Создать массив на 5 чисел.
    //! Заполнить его числами с клавиатуры.
    //! Найти максимальное и минимальное числа в массиве.
    //! Вывести на экран максимальное и минимальное числа через пробел.


    //! Создать список строк.
    //! Ввести строки с клавиатуры и добавить их в список.
    //! Вводить с клавиатуры строки, пока пользователь не введёт строку "end".  "end" не учитывать.
    //! Вывести строки на экран, каждую с новой строки.


    //! Посчитать сколько прошло времени с начала сегодняшнего дня. Используйте класс Date.


    //! Посчитать сколько дней прошло с начала года. Используйте класс LocalDate.


    //! Реверс числа
    //! 1) Ввести число с клавиатуры
    //! 2) Сделать реверс этого числа и вывести результат в консоль
    //! Пример:
    //! входные данные: -5544
    //! результат: -4455


}
