package roman.JavaInfo;

import java.util.LinkedList;

public class LinkedListInfo {
    //! Використовуйте ArrayList для зберігання та доступу до даних і LinkedList для маніпулювання даними.
    //! LinkedList зберігає свої елементи в "контейнерах".
    //! Список містить посилання на перший контейнер, а кожен контейнер має посилання на наступний контейнер у списку.
    //! Щоб додати елемент до списку, елемент поміщається в новий контейнер,
    //!     і цей контейнер зв’язується з одним з інших контейнерів у списку.

    //! У багатьох випадках ArrayList ефективніший, оскільки зазвичай потрібен доступ до випадкових елементів у списку,
    //!     але LinkedList надає декілька методів більш ефективного виконання певних операцій:
    //!         addFirst() 	Додати елемент на початок списку
    //!         addLast() 	Додати елемент у кінець списку
    //!         removeFirst() 	Видалити елемент з початку списку
    //!         removeLast() 	Видалити елемент із кінця списку
    //!         getFirst() 	Отримати предмет на початку списку
    //!         getLast() 	Отримати предмет у кінці списку


    public static void main(String[] args) {
        LinkedList<String> cars = new LinkedList<>();
        cars.add("Volvo");
        cars.add("BMW");
        cars.add("Ford");
        cars.add("Mazda");
        System.out.println(cars);
    }
}
